## Belajar Pandas (2)

In [32]:
import pandas as pd

In [33]:
df=pd.read_csv('misc/data_ptabc.csv', delimiter=';', header=2, skipfooter=2, engine='python')
df.set_index('no', inplace=True)
df

    nama  usia       kota       gaji
no
1   andi    21    jakarta  5000000.0
2   budi    22    bandung  6000000.0
3   caca    23      bogor  7000000.0
4   euis    24   surabaya  7000000.0
5   deni    25   semarang  8000000.0
6      -    26      depok  7500000.0
7   miki    27  tangerang  7600000.0
8   kiki    28        n.a        NaN

In [34]:
print("gaji maksimal:",df['gaji'].max())
print("gaji minimal:", df['gaji'].min())
print("gaji rata-rata:", df['gaji'].mean())
print("total gaji:", df['gaji'].sum())
print("modus gaji:", df['gaji'].mode())
print("media gaji:", df['gaji'].median())
print(df[df['gaji'] == df['gaji'].min()])
print(df[df['gaji'] == df['gaji'].min()][['nama','usia']])
df.loc[1]

gaji maksimal: 8000000.0
gaji minimal: 5000000.0
gaji rata-rata: 6871428.571428572
total gaji: 48100000.0
modus gaji: 0    7000000.0
dtype: float64
media gaji: 7000000.0
    nama  usia     kota       gaji
no
1   andi    21  jakarta  5000000.0
    nama  usia
no
1   andi    21

nama       andi
usia         21
kota    jakarta
gaji      5e+06
Name: 1, dtype: object

In [35]:
print(df[df['gaji'] > 23])

#menampilkan dari dua kondisi
print((df['usia'] < 23) & (df['kota'] == 'jakarta'))
print(df[(df['usia'] < 23) & (df['kota'] == 'jakarta')])
print(df[(df['usia'] < 23) | (df['kota'] == 'jakarta')])

# menampilkan antara value
print(df[(df['usia'] > 21) & (df['usia'] < 24)])
print(df[df['usia'].between(22,24)])

nama  usia       kota       gaji
no
1   andi    21    jakarta  5000000.0
2   budi    22    bandung  6000000.0
3   caca    23      bogor  7000000.0
4   euis    24   surabaya  7000000.0
5   deni    25   semarang  8000000.0
6      -    26      depok  7500000.0
7   miki    27  tangerang  7600000.0
no
1     True
2    False
3    False
4    False
5    False
6    False
7    False
8    False
dtype: bool
    nama  usia     kota       gaji
no
1   andi    21  jakarta  5000000.0
    nama  usia     kota       gaji
no
1   andi    21  jakarta  5000000.0
2   budi    22  bandung  6000000.0
    nama  usia     kota       gaji
no
2   budi    22  bandung  6000000.0
3   caca    23    bogor  7000000.0
    nama  usia      kota       gaji
no
2   budi    22   bandung  6000000.0
3   caca    23     bogor  7000000.0
4   euis    24  surabaya  7000000.0

In [36]:
xls_file=pd.read_excel('misc/data_ptabc.xlsx', header=2, skipfooter=2)
# xls_file[list(xls_file.columns)[::-1]]
print(xls_file.columns.tolist())
kol=xls_file.columns.tolist()
kol = kol[-1:] + kol[:-1]
kol

['no', 'nama', 'usia', 'kota', 'gaji']

['gaji', 'no', 'nama', 'usia', 'kota']

In [37]:
df.isnull().sum()

nama    0
usia    0
kota    0
gaji    1
dtype: int64

In [38]:
df.to_csv('misc/filebaru.csv',index=False)
df.to_excel('misc/filebaru.xlsx',sheet_name='Pandas',index=False)

### read HTML

In [39]:
df_html=pd.read_html('misc/day26.html')
print(df_html[0])

#write to json file
df_html[0].to_json('misc/day26.json', orient='records')

Nama  Usia      Kota
0  Andi    22   Jakarta
1  Budi    23   Bandung
2  Caca    24  Surabaya

In [40]:
df=pd.read_html('http://digidb.io/digimon-list/')
df[0]

,#,Digimon,Stage,Type,Attribute,Memory,Equip Slots,HP,SP,Atk,Def,Int,Spd
0,1,Kuramon,Baby,Free,Neutral,2,0,590,77,79,69,68,95
1,2,Pabumon,Baby,Free,Neutral,2,0,950,62,76,76,69,68
2,3,Punimon,Baby,Free,Neutral,2,0,870,50,97,87,50,75
3,4,Botamon,Baby,Free,Neutral,2,0,690,68,77,95,76,61
4,5,Poyomon,Baby,Free,Neutral,2,0,540,98,54,59,95,86
...,...,...,...,...,...,...,...,...,...,...,...,...,...
336,337,Alphamon NX,Mega,Vaccine,Neutral,6,1,980,104,109,114,109,116
337,338,Crusadermon NX,Mega,Virus,Dark,6,1,1030,100,118,99,109,121
338,339,Leopardmon NX,Mega,Data,Light,6,1,960,109,112,91,116,126
339,340,Omnimon NX,Mega,Vaccine,Light,6,1,1010,98,116,111,111,113
340,341,Gallantmon NX,Mega,Virus,Light,6,1,1070,93,122,109,111,108

# read HTML with HTTPS

In [41]:
import requests
url='https://pokemondb.net/pokedex/all'
x=requests.get(url)
df=pd.read_html(x.content)
df=df[0]
df.rename(columns={"#":"Number"}, inplace=True)
print(df)

#menampilkan pokemon yang paling gede Attack-nya
df[df['Attack'] == df['Attack'].max()]

Number                    Name          Type  Total   HP  Attack  \
0         1               Bulbasaur  Grass Poison    318   45      49
1         2                 Ivysaur  Grass Poison    405   60      62
2         3                Venusaur  Grass Poison    525   80      82
3         3  Venusaur Mega Venusaur  Grass Poison    625   80     100
4         4              Charmander          Fire    309   39      52
..      ...                     ...           ...    ...  ...     ...
921     805               Stakataka    Rock Steel    570   61     131
922     806             Blacephalon    Fire Ghost    570   53     127
923     807                 Zeraora      Electric    600   88     112
924     808                  Meltan         Steel    300   46      65
925     809                Melmetal         Steel    600  135     143

     Defense  Sp. Atk  Sp. Def  Speed
0         49       65       65     45
1         63       80       80     60
2         83      100      100     80
3        123      122      120     80
4         43       60       50     65
..       ...      ...      ...    ...
921      211       53      101     13
922       53      151       79    107
923       75      102       80    143
924       65       55       35     34
925      143       80       65     34

[926 rows x 10 columns]

,Number,Name,Type,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed
183,150,Mewtwo Mega Mewtwo X,Psychic Fighting,780,106,190,100,154,100,130

In [42]:
abc=pd.DataFrame({
    "A": [1,2,3,4],
    "B": [5,6,7,9]
})
#mencoba rename
abc.rename(columns={"A": "satu"}, inplace=True)
abc

   satu  B
0     1  5
1     2  6
2     3  7
3     4  9

### how to handle empty data

In [82]:
#how to handle empty data, add na_values keyword
df=pd.read_csv('misc/data_ptabc.csv',delimiter=';',header=2,skipfooter=2, engine='python',na_values=['-','n.a'])
print(df.isnull().sum())
#teknik 1
ab=df.fillna({
    "nama": "Anonymous",
    "usia": 25,
    "kota": "Jakarta",
    "gaji": 3900000
}, inplace=False)
print(ab)
print("")
#teknik forward filling
bc=df.fillna(method='ffill', axis='index') #index maksudnya menurun kebawah (columns)
print(bc)
print("")

#teknik backward filling
cd=df.fillna(method='bfill', axis='columns') #column maksudnya ke samping (row)
# cd=df.fillna({"gaji":3900000})
# cd['gaji'] = cd['gaji'].astype(int)
print(cd)
print("")

#teknik interpolate
de=df.interpolate()
print(de)
print("")
#interpolate combine
ef=df.interpolate().fillna({"nama":"ANONIM", "kota":"INDONESIA"})
print(ef)
print("")


#drop NaN
fg=df.dropna()
print(fg)
print("")

#drop NaN with threshold
hi=df.dropna(thresh=4) # threshold maksudnya minimal berapa data yang ada dalam satu baris (contohnya adalah minimal 4 data dalam satu baris)
print(hi)
print("")

#drop na with subset
ij=df.dropna(subset=['nama','usia'])
print(ij)
print("")

no      0
nama    1
usia    1
kota    1
gaji    1
dtype: int64
   no       nama  usia       kota       gaji
0   1       andi  21.0    jakarta  5000000.0
1   2       budi  25.0    bandung  6000000.0
2   3       caca  23.0      bogor  7000000.0
3   4       euis  24.0   surabaya  7000000.0
4   5       deni  25.0   semarang  8000000.0
5   6  Anonymous  26.0      depok  7500000.0
6   7       miki  27.0  tangerang  7600000.0
7   8       kiki  28.0    Jakarta  3900000.0

   no  nama  usia       kota       gaji
0   1  andi  21.0    jakarta  5000000.0
1   2  budi  21.0    bandung  6000000.0
2   3  caca  23.0      bogor  7000000.0
3   4  euis  24.0   surabaya  7000000.0
4   5  deni  25.0   semarang  8000000.0
5   6  deni  26.0      depok  7500000.0
6   7  miki  27.0  tangerang  7600000.0
7   8  kiki  28.0  tangerang  7600000.0

  no  nama     usia       kota     gaji
0  1  andi       21    jakarta    5e+06
1  2  budi  bandung    bandung    6e+06
2  3  caca       23      bogor    7e+06
3  4  euis       24   surabaya    7e+06
4  5  deni       25   semarang    8e+06
5  6    26       26      depok  7.5e+06
6  7  miki       27  tangerang  7.6e+06
7  8  kiki       28        NaN      NaN

   no  nama  usia       kota       gaji
0   1  andi  21.0    jakarta  5000000.0
1   2  budi  22.0    bandung  6000000.0
2   3  caca  23.0      bogor  7000000.0
3   4  euis  24.0   surabaya  7000000.0
4   5  deni  25.0   semarang  8000000.0
5   6   NaN  26.0      depok  7500000.0
6   7  miki  27.0  tangerang  7600000.0
7   8  kiki  28.0        NaN  7600000.0

   no    nama  usia       kota       gaji
0   1    andi  21.0    jakarta  5000000.0
1   2    budi  22.0    bandung  6000000.0
2   3    caca  23.0      bogor  7000000.0
3   4    euis  24.0   surabaya  7000000.0
4   5    deni  25.0   semarang  8000000.0
5   6  ANONIM  26.0      depok  7500000.0
6   7    miki  27.0  tangerang  7600000.0
7   8    kiki  28.0  INDONESIA  7600000.0

   no  nama  usia       kota       gaji
0   1  andi  21.0    jakarta  5000000.0
1   2  budi   NaN    bandung  6000000.0
2   3  caca  23.0      bogor  7000000.0
3   4  euis  24.0   surabaya  7000000.0
4   5  deni  25.0   semarang  8000000.0
5   6   NaN  26.0      depok  7500000.0
6   7  miki  27.0  tangerang  7600000.0

   no  nama  usia       kota       gaji
0   1  andi  21.0    jakarta  5000000.0
2   3  caca  23.0      bogor  7000000.0
3   4  euis  24.0   surabaya  7000000.0
4   5  deni  25.0   semarang  8000000.0
6   7  miki  27.0  tangerang  7600000.0
7   8  kiki  28.0        NaN        NaN

## cari data desa BPS:
- provinsi dengan desa terbanyak di tahun 2003, 2005, 2008, 2011, 2014, 2018
-